IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_clb_logic_config_regs.xml
	<register id="CLB_OUTPUT_LUT_2" width="32" page="1" offset="0x30" internal="0" description="Inp Sel, LUT fns for Out2">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_3" width="32" page="1" offset="0x32" internal="0" description="Inp Sel, LUT fns for Out3">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_4" width="32" page="1" offset="0x34" internal="0" description="Inp Sel, LUT fns for Out4">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_5" width="32" page="1" offset="0x36" internal="0" description="Inp Sel, LUT fns for Out5">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_6" width="32" page="1" offset="0x38" internal="0" description="Inp Sel, LUT fns for Out6">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_7" width="32" page="1" offset="0x3a" internal="0" description="Inp Sel, LUT fns for Out7">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_HLC_EVENT_SEL" width="32" page="1" offset="0x3c" internal="0" description="Event Selector register for the High Level controller">
		<bitfield id="EVENT0_SEL" description="Event Select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="EVENT1_SEL" description="Event Select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="EVENT2_SEL" description="Event Select 2" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="EVENT3_SEL" description="Event Select 3" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="ALT_EVENT0_SEL" description="Event Select 3" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ALT_EVENT1_SEL" description="Event Select 3" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ALT_EVENT2_SEL" description="Event Select 3" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ALT_EVENT3_SEL" description="Event Select 3" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_COUNT_MATCH_TAP_SEL" width="32" page="1" offset="0x3e" internal="0" description="Counter tap values for match1 and match2 outputs ">
		<bitfield id="COUNT0_MATCH1" description="Match1 tap select for Counter 0 " begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="COUNT1_MATCH1" description="Match1 tap select for Counter 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="COUNT2_MATCH1" description="Match1 tap select for Counter 2" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="COUNT0_MATCH2" description="Match2 tap select for Counter 0 " begin="20" end="16" width="5" rwaccess="RW"/>
		<bitfield id="COUNT1_MATCH2" description="Match2 tap select for Counter 1" begin="25" end="21" width="5" rwaccess="RW"/>
		<bitfield id="COUNT2_MATCH2" description="Match2 tap select for Counter 2" begin="30" end="26" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_0" width="32" page="1" offset="0x40" internal="0" description="Output conditioning control for output 0">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_1" width="32" page="1" offset="0x42" internal="0" description="Output conditioning control for output 1">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_2" width="32" page="1" offset="0x44" internal="0" description="Output conditioning control for output 2">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_3" width="32" page="1" offset="0x46" internal="0" description="Output conditioning control for output 3">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_4" width="32" page="1" offset="0x48" internal="0" description="Output conditioning control for output 4">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_5" width="32" page="1" offset="0x4a" internal="0" description="Output conditioning control for output 5">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_6" width="32" page="1" offset="0x4c" internal="0" description="Output conditioning control for output 6">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_COND_CTRL_7" width="32" page="1" offset="0x4e" internal="0" description="Output conditioning control for output 7">
		<bitfield id="LEVEL_1_SEL" description="Level 1 Mux Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LEVEL_2_SEL" description="Level 2 Mux Select" begin="2" end="1" width="2" rwaccess="RW"/>
		<bitfield id="LEVEL_3_SEL" description="Level 3 Mux Select" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SEL_GATING_CTRL" description="Gating control mux select" begin="7" end="5" width="3" rwaccess="RW"/>
		<bitfield id="SEL_RELEASE_CTRL" description="Releast control mux select" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="HW_GATING_CTRL_SEL" description="Select HW for gating control" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="HW_RLS_CTRL_SEL" description="Select HW for release control" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SEL_RAW_IN" description="Select input mode for the CLB AOC" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ASYNC_COND_EN" description="Enable for conditioning" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_MISC_ACCESS_CTRL" width="16" page="1" offset="0x50" internal="0" description="Miscellaneous Access and enable control">
		<bitfield id="SPIEN" description="Enable CLB SPI Buffer feature" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BLKEN" description="Block Register write" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_SPI_DATA_CTRL_HI" width="16" page="1" offset="0x51" internal="0" description="CLB to SPI buffer control High">
		<bitfield id="STRB" description="Select value for strobe" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="STRB_DEL" description="Strobe delay enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SHIFT" description="Shift value select" begin="12" end="8" width="5" rwaccess="RW"/>
	</register>
</module>
